package ru.javalang.module03.tasks.t13;

/**
 * Напишите программу, которая вводит с клавиатуры номер месяца и определяет, сколько дней в этом месяце.
 *  При вводе неверного номера месяца должно быть выведено сообщение об ошибке. Считается, что год невисокосный.
 * Входные данные
 *  Входная строка содержит единственное целое число – номер месяца (возможно, неправильный).
 * Выходные данные
 *  Выходная строка должна содержать одно целое число – количество дней в этом месяце или 0, если был введён неверный номер месяца.
 */

public class Main {
    public static void main(String[] args) {

    }
}
