package ru.javalang.module04.tasks.t01;

/**
 * В этой задаче нужно вводить с клавиатуры значения элементов массива.
 *
 * Нужно заполнить значения элементов массива числами последовательности:
 *
 * 4, 7, 10, 13, 16, ,,,
 *
 * и вывести получившийся массив на экран.
 *
 * Не будет считаться верным решение, в котором элементы последовательности просто выводятся на экран,
 * не попадая в массив.
 *
 * Например:
 *
 *  Input	                    Result
 *  6
 *  4 7 10 13 16 19         { 4, 7, 10, 13, 16, 19 }
 */
public class Main {
}
