package ru.javalang.module04.tasks.t03;

/**
 * Развернуть массив в обратную сторону ("задом наперед").
 *
 *  Последний элемент должен находится на месте начального и наоборот.
 *
 *  Не разрешается использовать дополнительный массив.
 *
 *  Не будет считаться верным решение, которое просто выводит на экран массив в обратном порядке, не меняя в памяти значение элементов массива.
 *
 *  For example:
 *
 *  Input	            Result
 *  6
 *  1 2 3 4 5 6	        6 5 4 3 2 1
 */
public class Main {
}
