package ru.javalang.module03.tasks.t14;

/**
 *  Напишите программу, которая вводит с клавиатуры номер месяца и день, и определяет, сколько дней осталось до Нового года. При вводе неверных данных должно быть выведено сообщение об ошибке. Считается, что год невисокосный.
 *  Входные данные
 *  Входная строка содержит два целых числа: номер месяца и номер дня в этом месяце.
 *  Выходные данные
 *  Программа должна вывести количество дней, оставшихся до Нового года. Если введены неверные данные, нужно вывести число -1.
 */

public class Main {
    public static void main(String[] args) {

    }
}
