package ru.javalang.module03.tasks.t19;

/**
 * Реализовать программу-лотерею.
 * Программа загадывает 5 (неповторяющихся) чисел в диапазоне от 1 до 42, но не показывает их на экран.
 * Пользователь пытается их угадать – вводит каких-то 5 чисел с клавиатуры.
 * Назначить призы за совпадение.
 *
 * Например, если пользователь угадал три числа - приз 300 рублей,
 * если 4 - 4000 рублей, если 5 – 50000 рублей.
 * И в целом, какова вероятность того, что пользователь угадает все 5 чисел?
 */

public class Main {
}
