package ru.javalang.module02.tasks.t04;

/**
 * Стоимость покупки
 * Пирожок в столовой стоит a рублей и b копеек. Определите, сколько рублей и копеек нужно заплатить за n пирожков.
 * Входные данные
 * Программа получает на вход три числа: a, b, n.
 * Выходные данные
 * Программа должна вывести два числа: стоимость покупки в рублях и копейках.
 *
 * For example:
 * --------------------------
 * |    Input   |   Result  |
 * --------------------------
 * |    10      |   20 30   |
 * |    15      |           |
 * |    2       |           |
 * --------------------------
 * |    2       |   10  0   |
 * |    50      |           |
 * |    4       |           |
 * --------------------------
 */
public class Main {
    public static void main(String[] args) {

    }
}
