package ru.javalang.module02.tasks.t05;

/**
 * Электронные часы показывают время в формате h:mm:ss, то есть сначала записывается количество часов, потом обязательно двузначное количество минут, затем обязательно двузначное количество секунд. Количество минут и секунд при необходимости дополняются до двузначного числа нулями.
 * С начала суток прошло n секунд. Выведите, что покажут часы.
 * Входные данные
 * Вводится целое число n.
 * Выходные данные
 * Выведите ответ на задачу, соблюдая требуемый формат.
 *
 * Input    Result
 * 3602     1:00:02
 * 129700   12:01:40
 */

public class Main {
}
