package ru.javalang.module05.tasks.t03;

/**
 * Применяя pattern-match выполните распознавание строк для простого тестирования:
 *
 * Формат теста:
 * ---------------------/
 * ? Вопрос
 * + Вариант ответа 1
 * - Вариант ответа 2
 * - Вариант ответа 3
 * - Вариант ответа 4
 * ---------------------/
 *
 * Каждый вопрос начинается с символа '?'
 * Каждый вариант ответа с '+' или '-', что соотвествует правильному и неверному ответу
 */

public class Main {
    public static void main(String[] args) {

    }
}
